abase
make embarrassed
subside
abdicate
aberration
abet
abeyance
abhor
abject
abjure
abnegate
abomination
aboriginal
abortive
abound
abridge
abrogate
absolute
absolve
abstinent
abstract
abstruse
abysmal
accede
accentuate
access
acclaim
accolade
accord
accost
accrue
acerbic
acquiesce
acquisitive
acquit
acrid
acrimonious
acronym
acumen
acute
ad-lib
adage
adamant
address
adduce
adherent
adjourn
adjunct
admonish
adroit
adulation
adulterate
advent
adventitious
adverse
advocate
aesthetic
affable
affectation
affidavit
affiliate
affinity
affliction
affluent
afford
affront
aftermath
agenda
aggrandize
aggregate
aggrieve
aghast
agnostic
agrarian
alacrity
alchemy
alienate
allege
allegiance
allegory
alleviate
allocate
allot
alloy
allusion
aloof
altercation
altruism
amass
ambience
ambiguous
ambivalent
ameliorate
amenable
amenity
amiable
amnesty
amorous
amorphous
anachronism
analogy
anarchy
anathema
ancillary
anecdote
angst
anguish
animosity
annex
annuity
anomaly
antecedent
antedate
anterior
anthology
anthropomorphic
antipathy
antipodal
antiquity
antithesis
apartheid
apathy
aperture
apex
aphorism
apocalypse
apocryphal
apogee
apoplexy
apostasy
apotheosis
appalling
apparition
appease
appellation
appendage
apportion
apposite
appraise
appreciate
apprehensive
apprise
approbation
appropriate
appurtenance
apropos
apt
aptitude
arbiter
arbitrary
arcade
arcane
archaic
archetype
archipelago
archives
ardent
arduous
arid
aristocratic
armament
armistice
arraign
arrant
arrears
arsenal
artful
articulate
artifice
artisan
ascendancy
ascertain
ascetic
ascribe
askance
aspersion
assail
assert
assess
assiduous
assimilate
assuage
astringent
astute
asylum
atheist
atone
atrophy
attest
attribute
attrition
audacity
augment
augur
august
auspices
auspicious
austere
autocratic
autonomous
auxiliary
avail
avant-garde
avarice
aversion
avert
avid
avow
avuncular
awry
axiom
bacchanal
baleful
balk
ballyhoo
balm
banal
bandy
bane
banter
baroque
barrage
bastion
bauble
bedlam
beget
begrudge
behest
belabor
beleaguer
belie
belittle
belligerent
bemoan
bemused
benediction
benefactor
benevolent
benighted
benign
bequest
bereaved
beset
bestow
bilious
bivouac
blanch
bland
blandishment
blasphemy
blatant
blight
bliss
blithe
bluster
bombast
boon
boor
booty
botch
bourgeois
bovine
bracing
brandish
bravado
brawn
brazen
breach
brevity
brink
bristle
broach
bromide
brouhaha
brusque
bucolic
buffoon
bulwark
bureaucracy
burgeon
burlesque
byzantine
cabal
cache
cacophony
cadence
cajole
calamity
callous
callow
calumny
candor
canon
cant
canvass
capacious
capital
capitalism
capitulate
capricious
captivate
carcinogenic
cardinal
careen
caricature
cartography
cascade
castigate
cataclysm
catalyst
categorical
catharsis
catholic
caucus
caustic
cavalier
cavil
celibacy
censure
cerebral
chaff
chagrin
chameleon
champion
channel
charisma
charlatan
chasm
chaste
chastise
cherub
chicanery
chimera
choleric
chortle
chronic
chronicle
churl
chutzpah
cipher
circuitous
circumlocution
circumnavigate
circumscribe
circumspect
circumvent
citadel
civil
clandestine
classic
cleave
clemency
cliche
climatic
clique
cloister
clone
clout
cloy
coalesce
coddle
coerce
cogent
cogitate
cognitive
cognizant
coherent
cohort
colloquial
collusion
commemorate
commensurate
commiserate
commodious
compatible
compelling
compendium
competent
compile
complacent
complement
complicity
comply
composed
comprehensive
comprise
compromise
compunction
concave
concede
concentric
concert
conciliatory
concise
concoct
concomitant
concord
concurrent
condescend
condone
conducive
confederate
confer
confidant
configuration
conflagration
confluence
confound
congeal
congenial
congenital
congregate
conjecture
conjugal
conjure
connive
connoisseur
consecrate
consensus
conservatory
consign
consolidate
consonant
conspicuous
consternation
constituency
construe
consummate
contempt
contentious
contiguous
contingent
continuum
contraband
contretemps
contrite
contrived
contumely
conundrum
convene
conventional
conversant
converse
convey
conviction
convivial
convolution
copious
cordial
corollary
corporeal
correlation
corroborate
corrosive
corrugated
cosmopolitan
coterie
countenance
coup
covenant
covert
covet
cower
crass
craven
credulous
crescendo
crestfallen
crevice
cringe
criterion
critique
crux
cryptic
cuisine
culinary
cull
culminate
culpable
curb
curmudgeon
cursory
curtail
cynic
daunt
dearth
debacle
debase
debauchery
debilitate
debunk
decadent
decimate
decorous
decree
decry
deduce
deem
defame
deference
deficit
defile
definitive
deft
defunct
degenerate
degrade
deign
deity
dejected
delectable
deleterious
delineate
delinquent
delude
deluge
delve
demagogue
demeanor
demise
demography
demur
demure
denizen
denomination
denote
denounce
depict
deplete
deplore
deploy
depose
depravity
deprecate
derelict
deride
derogatory
desiccate
desist
despondent
despot
destitute
desultory
devout
dexterous
dialectical
diatribe
dichotomy
dictum
didactic
diffident
diffuse
digress
dilapidated
dilate
dilemma
dilettante
diminution
dire
dirge
disaffect
disarray
discern
disclaim
discomfit
disconcert
discourse
discreet
discrepancy
discrete
discriminate
disdain
disgruntle
disinformation
disinterested
dismal
dismay
disparage
disparate
dispassionate
disperse
dispirit
disposition
disproportionate
disquiet
dissemble
disseminate
dissent
disservice
dissident
dissipate
dissolution
dissuade
distend
distinct
distinguish
diurnal
divine
divulge
docile
doctrinaire
document
dogmatic
doldrums
doleful
dolt
domestic
dormant
dotage
double
dour
downcast
downplay
draconian
droll
dross
dubious
duplicity
duress
ebb
ebullient
eccentric
ecclesiastical
eclectic
eclipse
ecosystem
edict
edifice
edify
efface
effectual
efficacy
effigy
effusion
egalitarian
egocentric
egregious
elation
electorate
elegy
elicit
elite
elliptical
elocution
elusive
emaciate
emanate
emancipate
embargo
embellish
embody
embroil
embryonic
emigrate
eminent
emissary
empathy
empirical
empower
emulate
encroach
endear
endemic
enervate
enfranchise
engaging
engender
enigma
enmity
ennui
enormity
ensue
entail
entity
entreat
entrepreneur
enumerate
envision
ephemeral
epicure
epigram
epilogue
epitome
epoch
equanimity
equestrian
equitable
equivocal
erudite
esoteric
espouse
estimable
estrange
ethereal
ethics
eulogy
euphemism
evanescent
evince
evoke
exacerbate
exacting
exalt
exasperate
excise
exemplify
exempt
exhaustive
exhort
exhume
exigency
existential
exodus
exonerate
exorbitant
expatriate
expedient
expedite
expiate
explicate
explicit
exposition
expostulate
expunge
exquisite
extant
extol
extort
extraneous
extrapolate
extremity
extricate
extrovert
exuberant
exult
fabrication
facade
facet
facetious
facile
faction
fallacy
farcical
fastidious
fatalist
fathom
fatuous
fauna
faux
fawn
fecund
feign
felicity
fervor
fester
fetish
fetter
fiasco
fiat
fickle
fidelity
figment
figurative
finesse
fiscal
flagrant
flaunt
fledgling
flippant
florid
flout
fodder
foible
folly
foment
foray
forbear
forebode
foreclose
forego
forensic
forestall
forsake
forswear
forte
forthright
fortuitous
foster
founder
fragmentary
fraternal
frenetic
frugal
fruitful
fuel
fulminate
furtive
futile
gaffe
galvanize
gambit
gamut
garner
garrulous
gastronomy
gauche
generic
genesis
genocide
genre
genteel
germane
gesticulate
ghastly
glut
grandiloquent
grandiose
gratis
gratuitous
gravity
gregarious
grievous
grimace
guile
guise
habituate
hackneyed
halcyon
hapless
harass
harbinger
harp
harry
hedonism
hegemony
heinous
herald
heresy
hermetic
heyday
hiatus
hierarchy
histrionic
hoary
homage
homily
homogeneous
hubris
husbandry
hyperbole
hypocrisy
hypothetical
iconoclast
ideology
idiom
idiosyncrasy
idyllic
ignominy
illicit
imbue
immigrate
imminent
immutable
impartial
impasse
impeach
impeccable
impecunious
impede
impending
impenetrable
imperative
imperial
impervious
impetuous
implement
implication
importune
impotent
impoverish
impregnable
impresario
impromptu
improvise
impugn
impunity
inadvertent
inalienable
inane
inaugurate
incandescent
incantation
incarnation
incendiary
incense
incessant
incipient
incisive
inclination
incongruous
incorrigible
increment
inculcate
incumbent
incursion
indict
indifferent
indigenous
indigent
indignant
indolent
induce
indulgent
ineffable
ineluctable
inept
ineradicable
inert
inexorable
infamous
infatuated
infer
infinitesimal
inflammatory
influx
infraction
infrastructure
infringe
infuse
ingenuous
ingratiate
inherent
inimical
injunction
innate
innocuous
innuendo
inordinate
inquisition
insatiable
insidious
insinuate
insipid
insolent
insouciant
instigate
insufferable
insular
insuperable
insurgent
insurrection
integral
integrate
interim
interloper
interlude
interminable
intermittent
intersperse
intervene
intimate
intractable
intransigent
intricate
intrigue
intrinsic
introspective
inundate
invective
inveterate
invidious
inviolate
invoke
irascible
iridescent
ironic
irrevocable
itinerant
jargon
jaunt
jingoism
jocular
jubilation
judicious
junction
junta
juxtapose
karma
kinetic
labyrinth
laconic
lament
lampoon
languish
larceny
largess
lascivious
latent
laud
lavish
lax
layman
legacy
lethargy
levity
liaison
libel
licentious
limpid
listless
litany
litigate
livid
loath
lobby
loquacious
lout
lucid
ludicrous
lugubrious
luminous
lyrical
machination
magnanimous
magnate
malaise
malapropism
malfeasance
malignant
malinger
malleable
mandate
mania
manifest
manifesto
marginal
marshal
martial
martyr
materialistic
matriculate
maudlin
maverick
mawkish
maxim
meander
mediate
medium
melancholy
melee
mellifluous
menagerie
mendacious
mendicant
mentor
mercenary
mercurial
metamorphosis
meticulous
microcosm
milieu
millennium
miniscule
mire
misanthropic
mitigate
mode
modulate
mollify
momentum
monolithic
moratorium
mores
moribund
morose
mortify
motif
motley
mundane
municipal
munificent
muse
muster
myopia
myriad
mystic
narcissism
nebulous
nefarious
nemesis
neologism
neophyte
nepotism
nihilism
nirvana
noisome
nomadic
nomenclature
nominal
nonchalant
nostalgia
notorious
novel
noxious
nuance
nullify
obdurate
obeisance
obfuscate
objective
oblique
oblivion
obscure
obsequious
obtrusive
obtuse
obviate
occult
odious
odyssey
officious
olfactory
oligarchy
ominous
omniscient
onerous
opaque
opprobrious
opulent
ordinance
orthodox
oscillate
osmosis
ostensible
ostentatious
ostracize
oust
override
overture
oxymoron
pacify
painstaking
palatable
palliate
pallor
palpable
paltry
panacea
pandemic
panegyric
parable
paradigm
paradox
paragon
parallel
paranoia
paranormal
parochial
parody
paroxysm
parsimonious
partisan
partition
pastoral
patent
paternal
pathology
pathos
patina
patriarch
patrician
patrimony
patronize
paucity
peccadillo
peculiar
pedantic
pedestrian
pejorative
penchant
penitent
pensive
peregrination
peremptory
perennial
perfidy
perfunctory
peripatetic
periphery
perjury
permeate
pernicious
perpetrator
perpetuate
perquisite
pertinent
perturb
peruse
pervade
perverse
petulant
phantasm
philanthropy
philistine
phlegmatic
pilgrimage
pious
pivotal
placate
placebo
plaintive
platitude
platonic
plausible
plebeian
plethora
pliable
plight
plunder
pluralism
poignant
polarize
polemic
ponderous
pontificate
porous
portent
posterity
posthumous
postulate
posture
pragmatic
prattle
precarious
precedent
precept
precipitate
precipitous
preclude
precocious
precursor
predecessor
predicament
predilection
predispose
predominant
preeminent
preempt
pregnant
prelude
premeditated
premise
preponderance
prepossess
prerogative
presage
presentiment
presumably
presuppose
prevail
primal
pristine
privation
proclaim
procure
prodigal
prodigious
prodigy
profane
profess
proficient
profligate
profound
profuse
progeny
proletariat
proliferate
prolific
promulgate
propagate
propensity
propitious
proponent
propound
proprietary
propriety
prosaic
proscribe
proselytize
protagonist
protege
protocol
protract
provident
provincial
provisional
provocation
prowess
proximity
prudent
prurient
pseudonym
psyche
pummel
punctilious
pundit
pungent
punitive
purblind
puritanical
putative
quaint
qualify
qualitative
quandary
quasi
quay
quell
querulous
query
queue
quiescent
quintessential
quixotic
quizzical
quotidian
ramification
rampant
rancor
rapacious
rapture
rarefied
ratify
ratiocination
rationale
raucous
reactionary
rebuff
rebuke
rebut
recalcitrant
recant
recidivism
reciprocal
reclaim
reclusive
recondite
recrimination
redeem
redolent
redress
redundant
referendum
refractory
refute
regime
regimen
reiterate
relegate
relentless
relinquish
remission
remonstrate
remuneration
renaissance
rend
render
renounce
reparation
repartee
repercussion
replenish
replete
replicate
repose
reprehensible
repress
reprimand
reprisal
reproach
reprobate
reprove
repudiate
repugnant
requisite
resignation
resolute
respite
resplendent
resurrection
reticent
retort
retrospect
revamp
revel
revere
revile
revulsion
rhapsodize
rhetoric
ribald
rife
rigorous
rivet
robust
rogue
rout
rudimentary
rue
ruminate
rustic
saccharine
sacrilege
sacrosanct
sagacious
salient
sally
salutary
salutation
sanctimonious
sanction
sanguine
sarcasm
sardonic
savant
scant
schism
scintillate
scorn
scrupulous
scrutinize
seamless
secede
seclusion
sect
secular
sedentary
sedition
segregate
self-made
sensory
sententious
sentient
sequester
serendipity
serene
serpentine
servile
shackle
shibboleth
shrewd
singular
sinister
skirmish
skittish
slake
slander
sloth
sobriety
solace
solidarity
solvent
soporific
sordid
sovereign
spate
spawn
specious
specter
spectrum
sporadic
spurious
spurn
squalor
squander
stagnation
stalwart
stark
static
staunch
steadfast
stigmatize
stint
stipend
stipulate
stoic
stolid
stout
stratagem
stratum
stricture
strife
stringent
stupendous
stupor
stymie
subjugate
sublime
subordinate
subside
subsidiary
subsidize
substantiate
substantive
subterfuge
subtle
subversive
succinct
succumb
suffice
suffrage
suffuse
sumptuous
supercilious
superficial
superfluous
supersede
supine
supplication
suppress
surfeit
surmise
surreal
surreptitious
surrogate
susceptible
sweeping
sycophant
syntax
synthesis
systemic
tacit
taciturn
tactical
taint
tangential
tangible
tantamount
tautological
tedium
teem
temerity
temperate
temporal
temporize
tenable
tenacious
tenet
tentative
tenuous
tepid
terse
theology
thesis
thorny
threshold
throttle
thwart
timorous
tirade
titillate
titular
toil
torpor
tortuous
touchstone
tout
toxic
transcend
transfix
transgress
transient
trauma
travesty
trenchant
trepidation
triumvirate
tryst
tumult
turbid
turmoil
turpitude
ubiquitous
uncanny
unconscionable
unctuous
underlying
undermine
underscore
underwrite
uniform
unilateral
unremitting
unwitting
urbane
usurp
usury
utilitarian
utopia
vacillate
vacuous
vagary
vanquish
vapid
vehement
venal
veneer
venerate
veracity
verbose
verdant
verge
verisimilitude
verity
vernacular
vestige
vex
viable
vicarious
vicissitude
vie
vigilant
vignette
vilify
vindicate
vindictive
virtuoso
virulent
viscous
visionary
vitiate
vitriolic
vivacious
vocation
vociferous
vogue
volatile
volition
voluminous
voluptuous
voracious
waft
waive
wake
wane
wanton
warrant
wary
willful
wistful
wizened
woe
wrath
zealous
perspective of the time
zenith
